Revit 2027 API
PointLightShape Properties
The PointLightShape type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightShape)
Top
See Also
Reference
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace